Tekla Open API Reference for Tekla Structures 2025
Events.DrawingReadyForIssuingChange Event
 The DrawingReadyForIssuingChange event is raised just after a drawing is marked or unmarked ready for issuing.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public event Events.DrawingReadyForIssuingChangeDelegate DrawingReadyForIssuingChange
Public Event DrawingReadyForIssuingChange As Events.DrawingReadyForIssuingChangeDelegate
Value
Type: Tekla.Structures.Drawing.Events.DrawingReadyForIssuingChangeDelegate
Implements
IEvents.DrawingReadyForIssuingChange
See Also
Reference
Events Class
Tekla.Structures.Drawing Namespace